In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Sunder','Nadella','Oranav','Mark','Sarly'],
       'Sales':[200,120,230,124,243,350]}

In [3]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   Sunder    120
2    MSFT  Nadella    230
3    MSFT   Oranav    124
4      FB     Mark    243
5      FB    Sarly    350

In [4]:
df_groupby = df.groupby('Company')
df_groupby

In [5]:
df_groupby.describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   177.000000
        std     74.953319
        min    124.000000
        25%    150.500000
        50%    177.000000
        75%    203.500000
        max    230.000000

In [6]:
df_groupby.describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                  \
          mean  ...      75%    max count   mean        std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  177.0  74.953319  124.0  150.5

Company
           50%    75%    max
Sales    177.0  203.5  230.0

[1 rows x 24 columns]

In [7]:
df_groupby.describe().transpose()['FB']

       count   mean        std    min     25%    50%     75%    max
Sales    2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [8]:
df_groupby.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     177.0

In [9]:
df_groupby.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       354

In [10]:
df_groupby.sum().loc["FB"]

Sales    593
Name: FB, dtype: int64